/*
* 平台通用枚举类型
*/

///支付的业务枚举 ： FROM 1 ~ 1000
module.exports.PAYMENT_BUSINESS_ENUM = {
    0: "活动门票",
    1: "万媒会员",
    2: "商品-"
}

///错误信息 ： FROM 1001 ~ 2000
module.exports.RESULT_ERROR_ENUM = {
    0: "",
    //1001~2000  活动相关
    1001: "活动无效",
    1002: "活动已过期",
    1003: "已截至售票",
    1004: "票已售罄",
    1005: "请重新选票",
    1006: "请正确填写购买数量",
    1007: "该渠道链接已失效，请重新购买",
    1008: "该渠道优惠已售罄",
    1009: "该渠道优惠已变更，请重新购买",
    1010: "该票据价格已变更，请重新购买",
    1011: "订单异常，请重新购买",
    1012: "订单状态已完成",
    1013: "渠道标识错误",
    1014: "活动标识错误",
    1015: "门票标识错误",
    1016: "渠道赠票已赠完，请重新购买",
    1017: "渠道赠票已失效，请重新购买",
    1018: "订单已支付，请勿重复支付",
    1019: "您已领取过该赠票，请勿重复领取！",
    1020: "优惠券不足",

    //2001~3000  用户相关
    2001: "用户参数错误",
    2002: "请填写用户名",
    2003: "该第三方用户已存在",
    2004: "无效用户",
    2005: "用户已是会员",
    2006: "用户被禁用",
    2007: "OPENID无效",
    2008: "导入的用户",



    //3001~5000 通用错误
    3001: "参数错误",
    3002: "手机号码不正确",
    3003: "未知错误",
    3004: "手机验证码不正确",
    3005: "数据不存在",

    // 5001~6000 地址相关
    5001: "请填写联系人",
    5002: "请填写详细地址",
    5003: "请正确选择城市",
    5004: "请正确选择地区",

    // 6001~6100 商品相关
    6001: "商品已经售罄",
    6002: "超出限制购买数量",
    6003: "请正确选择商品数量",
    6004: "请选正确填写收货人信息",

    //6101~6200 百人会
    6101: "无此服务券",
    6102: "服务券已用完",

}

/* 微信相关错误 30000~ */
module.exports.WECHAT_ERROR = {
    NONE: 0,
    URL_LOSE: 30000
}


/* 支付方式  */
module.exports.PAYMENT_TYPE = {
    WECHAT_PAY: 0,
    ALI_PAY: 1,
    UNIONPAY: 2,
    ELSE_PAY: 3
}

